FemDesign.Results.FeaNode
FemDesign "Node" result

FemDesign.Results.FeaNode.NodeId
Support name identifier

FemDesign.Results.FeaNode.X
X-coordinate

FemDesign.Results.FeaNode.Y
Y-coordinate

FemDesign.Results.FeaNode.Z
Z-coordinate

FemDesign.Results.FeaNode.DeconstructFeaNode(System.Collections.Generic.List{FemDesign.Results.FeaNode})
The method has been created for returning the value for Grasshopper and Dynamo.
The method can still be use for C# users.